{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of105.bin", "group1-shard2of105.bin", "group1-shard3of105.bin", "group1-shard4of105.bin", "group1-shard5of105.bin", "group1-shard6of105.bin", "group1-shard7of105.bin", "group1-shard8of105.bin", "group1-shard9of105.bin", "group1-shard10of105.bin", "group1-shard11of105.bin", "group1-shard12of105.bin", "group1-shard13of105.bin", "group1-shard14of105.bin", "group1-shard15of105.bin", "group1-shard16of105.bin", "group1-shard17of105.bin", "group1-shard18of105.bin", "group1-shard19of105.bin", "group1-shard20of105.bin", "group1-shard21of105.bin", "group1-shard22of105.bin", "group1-shard23of105.bin", "group1-shard24of105.bin", "group1-shard25of105.bin", "group1-shard26of105.bin", "group1-shard27of105.bin", "group1-shard28of105.bin", "group1-shard29of105.bin", "group1-shard30of105.bin", "group1-shard31of105.bin", "group1-shard32of105.bin", "group1-shard33of105.bin", "group1-shard34of105.bin", "group1-shard35of105.bin", "group1-shard36of105.bin", "group1-shard37of105.bin", "group1-shard38of105.bin", "group1-shard39of105.bin", "group1-shard40of105.bin", "group1-shard41of105.bin", "group1-shard42of105.bin", "group1-shard43of105.bin", "group1-shard44of105.bin", "group1-shard45of105.bin", "group1-shard46of105.bin", "group1-shard47of105.bin", "group1-shard48of105.bin", "group1-shard49of105.bin", "group1-shard50of105.bin", "group1-shard51of105.bin", "group1-shard52of105.bin", "group1-shard53of105.bin", "group1-shard54of105.bin", "group1-shard55of105.bin", "group1-shard56of105.bin", "group1-shard57of105.bin", "group1-shard58of105.bin", "group1-shard59of105.bin", "group1-shard60of105.bin", "group1-shard61of105.bin", "group1-shard62of105.bin", "group1-shard63of105.bin", "group1-shard64of105.bin", "group1-shard65of105.bin", "group1-shard66of105.bin", "group1-shard67of105.bin", "group1-shard68of105.bin", "group1-shard69of105.bin", "group1-shard70of105.bin", "group1-shard71of105.bin", "group1-shard72of105.bin", "group1-shard73of105.bin", "group1-shard74of105.bin", "group1-shard75of105.bin", "group1-shard76of105.bin", "group1-shard77of105.bin", "group1-shard78of105.bin", "group1-shard79of105.bin", "group1-shard80of105.bin", "group1-shard81of105.bin", "group1-shard82of105.bin", "group1-shard83of105.bin", "group1-shard84of105.bin", "group1-shard85of105.bin", "group1-shard86of105.bin", "group1-shard87of105.bin", "group1-shard88of105.bin", "group1-shard89of105.bin", "group1-shard90of105.bin", "group1-shard91of105.bin", "group1-shard92of105.bin", "group1-shard93of105.bin", "group1-shard94of105.bin", "group1-shard95of105.bin", "group1-shard96of105.bin", "group1-shard97of105.bin", "group1-shard98of105.bin", "group1-shard99of105.bin", "group1-shard100of105.bin", "group1-shard101of105.bin", "group1-shard102of105.bin", "group1-shard103of105.bin", "group1-shard104of105.bin", "group1-shard105of105.bin"], "weights": [{"name": "tf_bert_for_sequence_classification/bert/embeddings/word_embeddings/weight", "shape": [30522, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/token_type_embeddings/embeddings", "shape": [2, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/position_embeddings/embeddings", "shape": [512, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/embeddings/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._0/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._1/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._2/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._3/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._4/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._5/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._6/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._7/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._8/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._9/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._10/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/self/query/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/self/query/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/self/key/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/self/key/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/self/value/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/self/value/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/output/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/attention/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/intermediate/dense/kernel", "shape": [768, 3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/intermediate/dense/bias", "shape": [3072], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/output/dense/kernel", "shape": [3072, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/output/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/output/LayerNorm/gamma", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/encoder/layer_._11/output/LayerNorm/beta", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/pooler/dense/kernel", "shape": [768, 768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/bert/pooler/dense/bias", "shape": [768], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/classifier/kernel", "shape": [768, 6], "dtype": "float32"}, {"name": "tf_bert_for_sequence_classification/classifier/bias", "shape": [6], "dtype": "float32"}]}]}